---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.GetEnumerator
source: html/2a0ccb77-10ee-a157-7f34-e43ac7d455b7.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.